src/main/test/supply-chain/1-Grouping/0-Apply Tax/0-02_01_SUBCLASS-Grouping/7-TC02_01.08_Grouping_line_level_header_different_values-3TDS/0-TC02_01.08_Grouping_line_level_header_different_values-3TDS-GOODS-1/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <!--Optional:-->
         <arg0>
				<DocumentId>
					<SystemSourceId>ICI001</SystemSourceId>
					<TransactionId/>
				</DocumentId>
				<AlternateDocumentId>
					<CustomField1>UAT_CTE_TC1.2.16a</CustomField1>
					<CustomField2>GOODS_invoice_Grouping_line_level_different_values_3TDS</CustomField2>
					<CustomField3/>
					<CustomField4/>
					<CustomField5/>
					<CustomField6/>
					<CustomField7/>
					<CustomField8/>
					<CustomField9/>
					<CustomField10/>
				</AlternateDocumentId>
				<InvoiceLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</InvoiceLanguage>
				<CommunicationLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</CommunicationLanguage>
				<CalculationDecimalPlaces>5</CalculationDecimalPlaces>
				<PreviousInvoiceTaxCountry>DE</PreviousInvoiceTaxCountry>
				<TaxDecisionSet>
					<TaxDecisionSetId/>
					<SellerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</SellerTaxIndicator>
					<SellerTaxCountry/>
					<SellerTaxState/>
					<BuyerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</BuyerTaxIndicator>
					<BuyerTaxCountry/>
					<BuyerTaxState/>
					<CombinedTaxIndicator/>
					<CommercialIndicator/>
					<SellerTaxRegCountry/>
					<SellerTaxRegState/>
					<BuyerTaxRegCountry/>
					<BuyerTaxRegState/>
					<SellerTaxTotal>
						<NetAmount/>
						<TaxAmount/>
						<GrossAmount/>
						<TaxAmountInLocalCurrency/>
						<TaxInvoiceSubTotal>
							<TaxType>
								<TaxTypeName/>
								<TaxTypeAbbreviation/>
								<TaxTypeDescription/>
							</TaxType>
							<TaxCode/>
							<TaxRate/>
							<NetAmount/>
							<TaxAmount/>
							<GrossAmount/>
							<TaxAmountInLocalCurrency/>
						</TaxInvoiceSubTotal>
					</SellerTaxTotal>
					<BuyerTaxTotal>
						<NetAmount/>
						<TaxAmount/>
						<GrossAmount/>
						<TaxAmountInLocalCurrency/>
						<TaxInvoiceSubTotal>
							<TaxType>
								<TaxTypeName/>
								<TaxTypeAbbreviation/>
								<TaxTypeDescription/>
							</TaxType>
							<TaxCode/>
							<TaxRate/>
							<NetAmount/>
							<TaxAmount/>
							<GrossAmount/>
							<TaxAmountInLocalCurrency/>
						</TaxInvoiceSubTotal>
					</BuyerTaxTotal>
					<TaxComment>
						<TaxCommentType/>
						<TaxCommentText/>
					</TaxComment>
					<InvoiceCurrency>
						<CurrencyCode>EUR</CurrencyCode>
						<SellerLocalTaxCurrencyExchangeRate/>
						<SellerLocalTaxCurrencyCode/>
						<BuyerLocalTaxCurrencyExchangeRate/>
						<BuyerLocalTaxCurrencyCode/>
					</InvoiceCurrency>
					<LegalTaxCalculationLevel/>
					<TaxInvoiceLine>
						<LineNumber>1</LineNumber>
						<ItemNo>70104103</ItemNo>
						<ItemType>ART</ItemType>
						<UNSPSC>56000000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>8.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry/>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry/>
							<ConsigneeState/>
							<ConsigneeBusinessUnitCode/>
							<ConsigneeBusinessUnitType/>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
					<TaxInvoiceLine>
						<LineNumber>2</LineNumber>
						<ItemNo>13690607</ItemNo>
						<ItemType>ART</ItemType>
						<UNSPSC>10000000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>10.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry>BG</ConsignorCountry>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry/>
							<ConsigneeState/>
							<ConsigneeBusinessUnitCode/>
							<ConsigneeBusinessUnitType/>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
					<TaxInvoiceLine>
						<LineNumber>3</LineNumber>
						<ItemNo>70104103</ItemNo>
						<ItemType>ART</ItemType>
						<UNSPSC>10160000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>8.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry/>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry/>
							<ConsigneeState/>
							<ConsigneeBusinessUnitCode/>
							<ConsigneeBusinessUnitType/>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose>N</ResalePurpose>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
				</TaxDecisionSet>
				<TaxDate>
					<TaxAlgorithmDate>2013-03-01</TaxAlgorithmDate>
					<TaxCalculationDate/>
				</TaxDate>
				<TaxModuleBehaviour>
					<SkipCalculation>Y</SkipCalculation>
					<SkipDecision>N</SkipDecision>
				</TaxModuleBehaviour>
				<VariableTaxSteeringInput>
					<ConsignorCountry/>
					<ConsignorState/>
					<ConsignorBusinessUnitCode>22416</ConsignorBusinessUnitCode>
					<ConsignorBusinessUnitType>SUP</ConsignorBusinessUnitType>
					<ConsigneeCountry/>
					<ConsigneeState/>
					<ConsigneeBusinessUnitCode>278</ConsigneeBusinessUnitCode>
					<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
					<CarrierCountry/>
					<CarrierState/>
					<CarrierBusinessUnitCode/>
					<CarrierBusinessUnitType/>
					<ShipmentStartCountry/>
					<ShipmentEndCountry/>
					<ShipmentStartState/>
					<ShipmentEndState/>
					<ServiceRenderedCountry/>
					<ServiceRenderedState/>
					<ResalePurpose>Y</ResalePurpose>
					<IsOutBonded>N</IsOutBonded>
					<IsInBonded>N</IsInBonded>
					<TaxPreAlgorithmOutput>
						<IsExport>N</IsExport>
						<IsImport>N</IsImport>
						<IsExported>N</IsExported>
						<IsImported>N</IsImported>
					</TaxPreAlgorithmOutput>
					<ShippingOfCustomsClearedGoods/>
				</VariableTaxSteeringInput>
				<BuyerParty>
					<Party>
						<BusinessUnitCode>5430</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</BuyerParty>
				<SellerParty>
					<Party>
						<BusinessUnitCode>5100</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</SellerParty>
				<TermOfDelivery/>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>